https://api.twitter.com/2/tweets/search/recent?max_results=100&query=%28electric+car%29
{'data': [{'id': '1372970730749624333', 'text': 'RT @janekin24: So our village and town (rural) transport plan has electric car sharing point. Add this to the 75p per mile to drive planned…'}, {'id': '1372970606916898817', 'text': 'RT @NHRADragster: @NHRA met with @Dodge, @Ford, @GM, and @Toyota at the #GatorNats to discuss electric vehicle drag racing.  Lots of excite…'}, {'id': '1372970525249667075', 'text': "Shares have rallied this week after Volkswagen unveiled its plans to overtake Tesla as the world's largest electric car manufacturer.\n\nhttps://t.co/epEy9tmMYt"}, {'id': '1372970382764953604', 'text': 'BIG #ClimateFriday NEWS: Colorado is getting electric vehicle charging stations at each of its 42 state parks ⚡🚗\n@COParksWildlife commissioner: “This is putting us a little ahead of the curve.” #ActOnClimate\nhttps://t.co/vKcfBx0LTt'}, {'id': '1372970345880301569', 'text': 'RT @Bentler: Plug-in And Hike: Colorado Strikes Deal For Electric Car Chargers At Every State Park\n#Climate #Outdoors #Colorado\nhttps://t.c…'}, {'id': '1372969952639131652', 'text': "M made him sell his - was it Audi ? £71,000 car ?\n\n.\nHarry is seen for the first time since explosive O interview: Prince cycles electric bike near his £10m California home followed by security amid claim Queen is 'sad, not angry' at bombshell revelations\n\nhttps://t.co/tnoJMKGseb"}, {'id': '1372969832866590735', 'text': '@thatboistevie No really. They done pissed me off with that one 🤣 as much gas as i put in my car it shouldn’t be considered electric'}, {'id': '1372969510538465283', 'text': 'RT @janekin24: So our village and town (rural) transport plan has electric car sharing point. Add this to the 75p per mile to drive planned…'}, {'id': '1372969480146595850', 'text': 'Electric Car Market Share In Italy Grows 123% YOY In February https://t.co/N0aF4VzX0k #Tesla #ElonMusk'}, {'id': '1372969462861815808', 'text': '"There is much debate around the safety requirements of eVTOL aircraft, with some commentators for example, saying they should be twice as safe as driving a car" \n\nhttps://t.co/2fmYydBL6K via @Yahoo \n\n#evtol #aviation #advancedairmobility #safety'}, {'id': '1372969337959682054', 'text': 'RT @RichardWellings: Full electrification of vehicles is expected to trigger a 30% increase in electricity consumption. The costs of increa…'}, {'id': '1372969281663688706', 'text': "@mvmoxford If only we had stuck with EVs, we might have avoided all the damage that gasoline has caused us over the last century. Let's try to fix that now. Go electric with your next car."}, {'id': '1372969247278821379', 'text': "RT @NickAdamsinUSA: American companies shouldn't be allowed to ship our jobs off to Mexico! President Trump would NEVER let this happen! ht…"}, {'id': '1372969017921712136', 'text': '@HarryWilkinsonn My family car is 30 years old, it\'s cost me less than £2000 in the last 9 years to MOT and maintain it (two tires being the greatest single expense, they\'re 33" in diameter and 10.5" wide). It cost me £3800 to buy.\n\nNot seeing an electric car meeting that budget...'}, {'id': '1372968985436774403', 'text': 'RT @SkyGuyArt: Apparently this electric car model is called ebussy and it looks absolutely adorable. https://t.co/AQETUrQAY4'}, {'id': '1372968645261987855', 'text': '"The UK govt... unilaterally increased the cost of an electric car, which produces no carbon dioxide exhaust emissions while keeping the costs of burning petrol and diesel down – in the same year the country is hosting the UN’s Cop26 climate conference." https://t.co/8y23INKb5a'}, {'id': '1372968617785065484', 'text': 'RT @ThePatsGazette: United Auto Workers REJECT Ford Plan To Build New Electric Car in Mexico Versus Ohio https://t.co/u4O7KCvyRT'}, {'id': '1372968539720613892', 'text': "RT @AsiaNews_FR: #Taiwan 🇹🇼 #Vietnam 🇻🇳 Le Taiwanais Foxconn a proposé d'acquérir les lignes de production de véhicules électriques du Viet…"}, {'id': '1372968360951087104', 'text': 'I just found out the new electric Mustang is available in AWD, and I may have a winning argument in my case for buying an electric car next year. 😄'}, {'id': '1372967964228653074', 'text': '@MaxJerneck @asymco Limit car use, yes. But mostly in the (tiny) center of the cities (I am Dutch and regularly visit Amsterdam). But not limit EV use: electric bikes, scooters, delivery vans, single person EVs, etc ...\n\nAnyway city center car kms are already quite negligable in Amsterdam etc.'}, {'id': '1372967843986280455', 'text': "Russian Pleads Guilty in Tesla Hacking Scheme Prosecutors Say He Tried to Plant Malware in Electric Car Company's Network\nA Russian national who conspired to extort millions from electric car manufacturer Tesla by trying to plant malware in the company's… https://t.co/bg7gCeeool"}, {'id': '1372967806359138306', 'text': '@BryceWeiner Same with a car. Dont rush out and by an electric if you have a good vehicle. Buy an electric when the vehicle you have actually needs to be replaced.'}, {'id': '1372967494109995012', 'text': 'RT @techreview: Making electric cars more competitive with gas-powered ones will require a breakthrough battery. We believe that breakthrou…'}, {'id': '1372967273447653381', 'text': 'RT @SenatorKolker: Every Colorado state park will soon have at least a pair of electric vehicle chargers under a new partnership with an el…'}, {'id': '1372967135723491329', 'text': 'If you make an electric car you’re exempt from exploitation 💁🏻‍♀️ https://t.co/cu2UtQUWYS'}, {'id': '1372966989233278976', 'text': "@Thom_Hartmann , I miss the beginning of the call, but it sounded like one of your listeners claims an electric car could charge itself with an alternator. That's not possible, it would violate the laws of physics."}, {'id': '1372966938486394885', 'text': '@AnytimeGorgeous @jordanbpeterson Maybe you can start your own electric car, high speed transit and space exploration company and show him how to do it better.'}, {'id': '1372966763806220295', 'text': 'RT @happysadness: UK slashes grants for electric car buyers while retaining petrol vehicle support — and this:  https://t.co/LTqdv0unLC'}, {'id': '1372966747762872322', 'text': "RT @AlexWitzleben: Recycling batteries key to EU's electric car drive, says minister https://t.co/j4KP9GCMkK #batteries #battery #EUGreenDe…"}, {'id': '1372966733963800580', 'text': "RT @AfricaFactsZone: Africa's first battery pick up bakkie has been built by South African electric car and battery company, Mazibuko Motor…"}, {'id': '1372966708823003139', 'text': "RT @AlexWitzleben: Kia Just Released Photos of Its First Electric Car - And They're Incredible - Range of 500 km - via @Entrepreneur @SoyEn…"}, {'id': '1372966644453154816', 'text': '@Thom_Hartmann I missed the beginning of the call, but it sounded like one of your listeners claimed that an electric car could charge itself with an alternator. That violates the laws of physics.'}, {'id': '1372966372955856896', 'text': "Kia Just Released Photos of Its First Electric Car - And They're Incredible - Range of 500 km - via @Entrepreneur @SoyEntrepreneur https://t.co/mlEPsr1m2S #Kia #EUGreenDeal #ClimateActionNow #ElectricCar #electriccars #ElectricVehicles #EVs #Tesla #cars #Autos #VW #Daimler #BMW"}, {'id': '1372966314390732803', 'text': '@Struggler2Dark WHERE’S M’GODDAMN ELECTRIC CAR BRUCE'}, {'id': '1372966311303741455', 'text': 'RT @WEschenbach: Gosh, here I was a climate skeptic for years. But then I saw someone holding up a meaningless sign underwater, and that wa…'}, {'id': '1372966288994267139', 'text': "Mini ne vendra plus que des voitures électriques en 2030. Il est vrai qu'au Royaume Uni, la vente de voitures thermiques sera interdite à cette date... https://t.co/s3JDUYv8Sh"}, {'id': '1372966214159503371', 'text': 'RT @BMW: The largest, the greenest and the leaders...\nRead about electric car facts from around the world: https://t.co/Psr1NeKDTm'}, {'id': '1372966167967453184', 'text': 'RT @SenatorKolker: Every Colorado state park will soon have at least a pair of electric vehicle chargers under a new partnership with an el…'}, {'id': '1372966148027846657', 'text': 'RT @nickhedley: Local car tech startup launches SAs first electric bakkie - https://t.co/mLxCGDYEck via @ventureburn'}, {'id': '1372966024996339715', 'text': "Recycling batteries key to EU's electric car drive, says minister https://t.co/j4KP9GCMkK #batteries #battery #EUGreenDeal #ClimateActionNow #ElectricCar #electriccars #ElectricVehicles #EVs #Tesla #cars #Autos #VW #Daimler #BMW #PSA #Renault #Peugeot #citroen #Volvo #Fiat #Opel"}, {'id': '1372966006008602624', 'text': 'Gosh, here I was a climate skeptic for years. But then I saw someone holding up a meaningless sign underwater, and that was so overwhelming, it touched my heart so strongly that now I want to buy a coal-powered electric car and move to Mauritius to help the climate heal ...\n\nw. https://t.co/MgfBygQHgB'}, {'id': '1372965945912791055', 'text': 'RT @Struggler2Dark: "Y\'know? It\'s funny. I was actually gonna give you your fucking electric car before you started talking shit."\n"..." ht…'}, {'id': '1372965820863774731', 'text': 'RT @Struggler2Dark: "Y\'know? It\'s funny. I was actually gonna give you your fucking electric car before you started talking shit."\n"..." ht…'}, {'id': '1372965812760363022', 'text': 'RT @VWGroup: „@SEATofficial is the fastest growing car brand in Europe, @CUPRA becomes the unconventional electric brand that goes from Spa…'}, {'id': '1372965711161737218', 'text': "RT @whatcar: For the money, VW's new #ID4 is a very good electric car. It’s practical, the 77kWh battery provides a great electric range an…"}, {'id': '1372965684569894912', 'text': 'RT @Struggler2Dark: "Y\'know? It\'s funny. I was actually gonna give you your fucking electric car before you started talking shit."\n"..." ht…'}, {'id': '1372965605834375170', 'text': 'RT @Struggler2Dark: "Y\'know? It\'s funny. I was actually gonna give you your fucking electric car before you started talking shit."\n"..." ht…'}, {'id': '1372965598418853892', 'text': 'Government cuts electric car grant from £3000 to £2500  https://t.co/prdIk0gaoe£3000-£2500 via @autocar #BorisJohnson #BrexitReality #EUGreenDeal #ClimateActionNow #ElectricCar #electriccars #ElectricVehicles #EVs #Tesla #cars #Autos #VW #Daimler #BMW #PSA #Renault #Peugeot'}, {'id': '1372965435998617607', 'text': 'RT @Struggler2Dark: "Y\'know? It\'s funny. I was actually gonna give you your fucking electric car before you started talking shit."\n"..." ht…'}, {'id': '1372965325478723591', 'text': "RT @NickAdamsinUSA: American companies shouldn't be allowed to ship our jobs off to Mexico! President Trump would NEVER let this happen! ht…"}, {'id': '1372965303420878848', 'text': '"Y\'know? It\'s funny. I was actually gonna give you your fucking electric car before you started talking shit."\n"..." https://t.co/K3qtlctZa5'}, {'id': '1372965103260303360', 'text': 'RT @DShishiwaji: Today d Director-General, National Automotive Design &amp; Development Council, NADDC, Jelani Aliyu presented to Gov Mai Mala…'}, {'id': '1372964996724953097', 'text': '#cobalt, #nickel free #electriccars #batteries are a runaway success #Tesla https://t.co/ULL6iOKxKR'}, {'id': '1372964973505257472', 'text': '@artb0i @CosmonautMarcus Joker....The Clown Prince of Crime....bought an electric car. Even he cares about the environment lmaooooo'}, {'id': '1372964653748383751', 'text': 'RT @tesla_adri: Since the UK government excluded the model 3 from the electric vehicle grant by reducing the max. price of a eligible car t…'}, {'id': '1372964560680943621', 'text': 'Ford to go all-electric by 2030, and claim they will have all zero-emission "capable" models from 2026.  https://t.co/73h5JODCxT'}, {'id': '1372964526648389635', 'text': 'RT @gualestrit: 🚗 Ganancias en las acciones de fabricantes de automóviles en 2021\n\nhttps://t.co/pwXK4UiL6r https://t.co/L17NrHqbjf'}, {'id': '1372964136414552066', 'text': '@ComicBook WHERES MY GODDAMN ELECTRIC CAR BRUCE!?'}, {'id': '1372964006823145479', 'text': 'RT @auto_schmidt: What is the current status of the European electric car market?\n\n- 746k volumes during the last 12-months\n- CY 2020: 728k…'}, {'id': '1372963935570255874', 'text': 'RT @statesman: Electric car manufacturers are looking to outfit their vehicles with onboard generators to power, which could be used to pow…'}, {'id': '1372963758717407244', 'text': 'RT @TTStroud: Just 3 days left to contribute to our survey with @Co_wheels – YOUR answers will determine whether Stroud District gets an el…'}, {'id': '1372963743315988485', 'text': 'The internal combustion engine is all but sputtered out. It’s left behind some questions:\n\nAre electric cars really that green? Is car membership the new norm? What happened to driverless?\n\nGrab a free trial ticket for the #FutureOfCarsSummit here: https://t.co/pLtFCoG7NO https://t.co/069LpwS4KV'}, {'id': '1372963693286281230', 'text': 'Keep in touch with your DS via the My DS mobile app. Includes features such as charge status, approximate range in electric mode, connection status of the car, programming temperature pre-set and more. \n#EV  #Technology #Brighton #TatesCars #Crawley #AutoExpress #ElectricCars https://t.co/vjYH3zLU7k'}, {'id': '1372963582057586690', 'text': 'Electric car manufacturers are looking to outfit their vehicles with onboard generators to power, which could be used to power homes during a blackout and avoid the potential health hazards from carbon monoxide exhausts. https://t.co/hkCL0pcfl1'}, {'id': '1372963419494694916', 'text': 'Where’s my goddamn electric car Bruce????'}, {'id': '1372963415145201669', 'text': 'RT @tesla_adri: Since the UK government excluded the model 3 from the electric vehicle grant by reducing the max. price of a eligible car t…'}, {'id': '1372963384702959617', 'text': 'https://t.co/hWpZuUUrY3'}, {'id': '1372963378898079748', 'text': 'Amazon adds San Francisco to the big-city regions now using Rivian electric delivery trucks. We get some follow-up time driving the Honda CR-V Hybrid. And those seeking a speedy charge while shopping have a new option in the Midwest.  # # # # # # # # # #\n\nhttps://t.co/E2xP9eCFGo'}, {'id': '1372963323805831172', 'text': "@raffaeru Im driving manual all my life. Didn't know how much it sucks until i tried an electric car. In traffic it's a game changer."}, {'id': '1372963283452461071', 'text': '2022 BMW i4 sedan normalizes model’s electrical car lineup – Information by https://t.co/jf2QUxT8dS https://t.co/K9lk3kG0KV'}, {'id': '1372963278431907845', 'text': 'Go with the BRT for goodness sake. Opponents Of Bus Rapid Transit Propose One Electric Car For Each Current Bus Rider https://t.co/sw5k3r4od2 via @rvkgrapevine'}, {'id': '1372963015981551616', 'text': 'RT @praveen09512: आत्मनिर्भर भारत..\nभारत की कम्पनी है Pravaig\nइसने भी Tesla की ही तरह एक Electric Car बनाई है जो Tesla से हर लिहाज में अ…'}, {'id': '1372962913540014091', 'text': 'RT @ThePatsGazette: United Auto Workers REJECT Ford Plan To Build New Electric Car in Mexico Versus Ohio https://t.co/u4O7KCvyRT'}, {'id': '1372962792370765832', 'text': 'I just bought a cool new Wii U The electric car was killed by Walt Disney!'}, {'id': '1372962716462157827', 'text': "Tech Update:  Daimler is converting its engine plant in Berlin into a digital campus and hundreds of jobs may be in danger https://t.co/Ej5MXX0KcF ...Let's Discuss? #digitaltransformation #digitalstrategy #digitalworkplace https://t.co/eJGfoXWqX6"}, {'id': '1372962555627507715', 'text': 'What idiot called it a plug in electric car subsidy instead of Car E-Grant?'}, {'id': '1372962329990721540', 'text': '#Franklin #StCharles, #GolfCart Seat Cover Set Fit for #ClubCar DS Precedent &amp; Yamaha, Keep Warm Bench Seat Covers Breathable Washable Polyester Mesh Cloth. #Amazon, your #GolfCar Parts Source! https://t.co/lGOfrxlVc8'}, {'id': '1372962303163822080', 'text': 'https://t.co/rSD65XTXmL'}, {'id': '1372962199514148865', 'text': '@johnvoelcker @Ford Well yeah...PHEV are dumb anyway. All electric car companies are the way to go.'}, {'id': '1372961961915396106', 'text': "SMEG got people crazy with that electric stove that is also a gas stove. I wonder when they are making a car that is also a bicycle so y'all can lose your heads again https://t.co/NHOFshYSyg"}, {'id': '1372961823524331524', 'text': '@BilNaylor_ @davidofbuderim @HarryWilkinsonn @thegwpfcom OK, I’ll take the bait:\nI have been driving electric up and down the UK for over a year. No issue with infrastructure noticed. See ZapMap for details\n\nManufacture of ICE cars is also far from carbon neutral\n\nMany electric car batteries are also made in the US, so what?'}, {'id': '1372961471995461640', 'text': '@mirazaslove @AaronTrades8 @MysteryMan_777 $200 Billion in cash and some of the smartest people in the world - The electric vehicle potential is being over looked here. 🤷‍♂️Just wait for that product launch presentation 🤯 Autonomous Computer cars- I would imagine they can pull it off. ⌛️ \n\nhttps://t.co/5AeglPmJlU'}, {'id': '1372961368006086657', 'text': '@JeremyClarkson Recommendations for family electric car?'}, {'id': '1372961147347931140', 'text': "I've just read Government limits Plug-In Car Grant on @AutoTrader_UK https://t.co/ojw0otYadW #electric #ElectricVehicle"}, {'id': '1372961088631869440', 'text': "RT @lightyear_cars: Instead of physically building all of our concepts, we use the 'Vehicle Performance Model' to find the most efficient a…"}, {'id': '1372960973401645065', 'text': '@mysterythembo A regional legislator told me at the grand opening of an electric car charging station that they would never remove it. I hope to live to see him take those words back.'}, {'id': '1372960810474033156', 'text': 'This Saturday learn all about how @DeltaMotorsport developed the battery pack 🔋 to survive the brutal environment of touring car racing from Managing Director Simon Dowson 🏁 \n\nPLUS.. learn how @BTCC plans to utilise the hybrid package 📚\n\n➡️ https://t.co/TaBy41z6eX https://t.co/nZXMdQlDO4'}, {'id': '1372960779884957702', 'text': '#hashtag1 Electric Portable Massage Car Chair https://t.co/zbstfWA8AD https://t.co/WK18CH351U'}, {'id': '1372960615631884289', 'text': 'RT @slashdot: Chuck Schumer Wants To Replace Every Gas Car in America With an Electric Vehicle https://t.co/Zm1Ho34uBF'}, {'id': '1372960520232312833', 'text': '@CityOfVictoria @PlugInBC @crd_bc @saanich City of Victoria = feel good Morons . Bike lanes that get very little use , Drug addicts pawned as homeless . Electric cars are only good for the rich , and the Engine aka the Battery pack have a finite lifespan and then the car is worthless'}, {'id': '1372960385087766533', 'text': '@asda can somebody please contact me about the poor parking regulation signage at Brighton Marina. You are nothing more than common criminals! If the car park is closed after 5pm on Sunday , put a barrier across it. Don’t allow use of the electric car charge and then fine them.'}, {'id': '1372960098906148866', 'text': 'RT @leming_andrew: Slashing the value of the EV grant is another example of the Government undermining its own climate agenda in recent wee…'}, {'id': '1372959974742233089', 'text': 'RT @AbhinayBhandari: 22 out of 1000 people have a car in India.\n83 out of 1000 people have a car in Sikkim.\nWith an adequate power supply,…'}, {'id': '1372959948494225410', 'text': "Prosecutors Say He Tried to Plant Malware in Electric Car Company's NetworkA Russian national who conspired to extort millions from electric car manufacturer Tesla by trying to plant malwa... via @BnkInfoSecurity #infosec #tech #FridayFeeling https://t.co/7kxsPCeosC"}, {'id': '1372959802125606914', 'text': '@yanderelex "Yea Bruce you got all those smart ass scientists at Wayne Industries but you can\'t make one simple electric car?" https://t.co/8iFmcA2yVn'}, {'id': '1372959665118666754', 'text': "Free Electric Vehicle Charging for Guests at Wallops Wood - https://t.co/4XM5lkLKI9 We're proud of our green credentials &amp; in 2020 we installed an EV charger. This means guests arriving in an electric car can charge their vehicle for free throughout the duration of their stay! https://t.co/vT8WVpChNZ"}, {'id': '1372959616968056832', 'text': '@hrrysgreysuit Electric bike...diesel/petrol ‘security’ car following 🙄'}, {'id': '1372959530804514820', 'text': 'RT @tesla_adri: Since the UK government excluded the model 3 from the electric vehicle grant by reducing the max. price of a eligible car t…'}, {'id': '1372959499254788109', 'text': '@ErikSolheim Let’s hope @VWGroup has a similar roadmap for India. Huge fan of their vehicles.. can’t wait for them to bring in their electric car range here.'}, {'id': '1372959276914860032', 'text': 'RT @LiorSteinberg: The electric car is not the solution, just the creation of another problem.\n“Materials needed to make the batteries for…'}], 'meta': {'newest_id': '1372970730749624333', 'oldest_id': '1372959276914860032', 'result_count': 100, 'next_token': 'b26v89c19zqg8o3fosqrv3wggwpjadzrszzz83t5ae8vx'}}