{"data": [{"id": "1372959187035037701", "text": "Backlash grows against cut to electric car grants https://t.co/WvNAEdQvmE https://t.co/5BjqJDJOj4"}, {"id": "1372959100900945927", "text": "Add another automotive patent to the list for @Apple. The tech giant discusses an automatic zone-based lighting system that illuminates a vehicle's interior when needed with the help of cameras and sensors. More from @motorauthority &amp; @SAEdelstein here:  https://t.co/eHRo5Tqei1. https://t.co/PUT38keKAG"}, {"id": "1372959038263164931", "text": "Doug Ford: Bring back Electric Vehicle Incentives in Ontario, Canada. https://t.co/UmVj9Fv3uZ via @CdnChange My current car is used and my goal is to cut CO2 emissions and go electric. The price of the car needs to be caped and the current Cdn Federal level."}, {"id": "1372959016083656704", "text": "RT @RichardWellings: Full electrification of vehicles is expected to trigger a 30% increase in electricity consumption. The costs of increa…"}, {"id": "1372958884097232897", "text": "While BigGrid is just salivating at all the capital they can plow into shipping electrons all over creation, B4 the US spends serious money on more Grid, we need to study the optimal topology. \n\nIf I can plug my car into my roof I don't need ANY grid!\n\nhttps://t.co/yy1ObaEjEH"}, {"id": "1372958771266338821", "text": "@climatemorgan @Greenpeace @POTUS @ClimateEnvoy @SecYellen Remove:\n\nCoal: 820g CO2 kW/h\nOil: 650g\nGas: 490g\nMarginal emissions,\nGreen hydrogen: 550g\nElectric car: 550g\n\nReduce! Not produce"}, {"id": "1372958683618025479", "text": "RT @gualestrit: 🚗 Ganancias en las acciones de fabricantes de automóviles en 2021\n\nhttps://t.co/pwXK4UiL6r https://t.co/L17NrHqbjf"}, {"id": "1372958631990296579", "text": "@Greenpeace Remove:\n\nCoal: 820g CO2 kW/h\nOil: 650g\nGas: 490g\nMarginal emissions,\nGreen hydrogen: 550g\nElectric car: 550g\n\nReduce! Not produce"}, {"id": "1372958556664827914", "text": "@Greenpeaceafric @Greenpeace @Shenever_knew Remove:\n\nCoal: 820g CO2 kW/h\nOil: 650g\nGas: 490g\nMarginal emissions,\nGreen hydrogen: 550g\nElectric car: 550g\n\nReduce! Not produce"}, {"id": "1372958515950669831", "text": "@Fridays4future @Greenpeace @StanChart Remove:\n\nCoal: 820g CO2 kW/h\nOil: 650g\nGas: 490g\nMarginal emissions,\nGreen hydrogen: 550g\nElectric car: 550g\n\nReduce! Not produce"}, {"id": "1372958479061819394", "text": "Going from a gas powered car to a electric one is gonna make me so lazy if I ever have to fill up a car that requires gasoline.\n\nElectric cars so convenient the charger isn’t even heavy and the driving dynamics of an electric car are better. Low center of gravity = fun corners."}, {"id": "1372958450175537153", "text": "RT @AbhinayBhandari: 22 out of 1000 people have a car in India.\n83 out of 1000 people have a car in Sikkim.\nWith an adequate power supply,…"}, {"id": "1372958367170301957", "text": "@wef @1t_org Remove:\n\nCoal: 820g CO2 kW/h\nOil: 650g\nGas: 490g\nMarginal emissions,\nGreen hydrogen: 550g\nElectric car: 550g\n\nReduce! Not produce"}, {"id": "1372958333179736071", "text": "@wef Remove:\n\nCoal: 820g CO2 kW/h\nOil: 650g\nGas: 490g\nMarginal emissions,\nGreen hydrogen: 550g\nElectric car: 550g\n\nReduce! Not produce"}, {"id": "1372958267610173446", "text": "Still on the fence about getting an electric car (tesla). Do you think it will have a 15 year lifespan. Is it cost efficient.\nI know it's cool and has all the bells and whistles, but dropping house money on a car, it would really have to be worth it in the long run...."}, {"id": "1372958042531246088", "text": "RT @ElectrifyingCom: Trying to work out which are the 10 BEST EVs that still qualify for the £2,500 Government plug-in grant?\n \nWe've had @…"}, {"id": "1372958017168179200", "text": "RT @tesla_adri: Since the UK government excluded the model 3 from the electric vehicle grant by reducing the max. price of a eligible car t…"}, {"id": "1372957739413086219", "text": "RT @completecar: Audi has revealed a few of the secrets of the upcoming all-electric Q4 e-tron SUV ahead of the car's full reveal in April.…"}, {"id": "1372957694936686592", "text": "RT @completecar: The new electric Kia EV6 uses the same platform as Hyundai Ioniq 5.\n\nWe've got all the details in our news story. https://…"}, {"id": "1372957624564555778", "text": "RT @zenrainman: The history of groundwater is intrinsically linked to technology. Draught animals were tamed to lift water. The pulley beca…"}, {"id": "1372957591442133000", "text": "RT @whatcar: For the money, VW's new #ID4 is a very good electric car. It’s practical, the 77kWh battery provides a great electric range an…"}, {"id": "1372957535599222793", "text": "RT @ElectrifyingCom: Trying to work out which are the 10 BEST EVs that still qualify for the £2,500 Government plug-in grant?\n \nWe've had @…"}, {"id": "1372957281105629185", "text": "Excellent analysis from Which? Please can the Government fix these issues, so it is as easy to travel the country recharging as to fill up with petrol. We have an electric car with its own home fast charging point. It has a great r…https://t.co/lS13jm4SxT https://t.co/yixXDLdV6o"}, {"id": "1372957217595527168", "text": "RT @tesla_adri: Since the UK government excluded the model 3 from the electric vehicle grant by reducing the max. price of a eligible car t…"}, {"id": "1372957197907337217", "text": "RT @WattsUpUK: Volvo's first electric car!\n\nImpressive stats too:\n⚡️ 78kWh battery\n⚡️ 248 mile range\n⚡️ 150kW CCS charging\n\nWill you be buy…"}, {"id": "1372957056546664448", "text": "“The frenzy has already led to trouble. The stock of Nikola, an electric car start-up that went public via a SPAC in June, has plunged more than 80 percent...”  https://t.co/dpBxiMy3zL"}, {"id": "1372957048166563842", "text": "For the money, VW's new #ID4 is a very good electric car. It’s practical, the 77kWh battery provides a great electric range and it’s well equipped.\n\nBut is it the BEST new large electric car on sale? We've put it through our full UK road test to find out: https://t.co/tTzBfd7K36 https://t.co/8dw3oGG6dd"}, {"id": "1372956648197734405", "text": "RT @gualestrit: 🚗 Ganancias en las acciones de fabricantes de automóviles en 2021\n\nhttps://t.co/pwXK4UiL6r https://t.co/L17NrHqbjf"}, {"id": "1372956605499727882", "text": "Are you interested in having electric car charging ports installed to your business car park❓\n\nHES can bring you into the modern age with a first class installation service ✅\n\nFor more information visit https://t.co/mLR6BnrtzR or call 01325 249294.\n\n#ElectricCarCharging #HES https://t.co/r2NOOjQVBL"}, {"id": "1372956575284002820", "text": "Recycling batteries key to EU's electric car drive, says minister https://t.co/lCWk5bnKoz"}, {"id": "1372956509777317893", "text": "RT @TeslaForThe_Win: Ever wonder who drives the electric car Tesla?......Lady Gaga drives a Tesla....she likes that Tesla uses faux leather…"}, {"id": "1372956435106172929", "text": "@FreshairIan @Ogilvie_CJ @rnaunton @HS2ltd The existing town roads in that scenario are a huge benefactor of the bypass being built. The parts that you can't compare to roads is the energy efficiency of an electric railway vs a car and the lower land requirements for rail vs a road. 2/2"}, {"id": "1372956390864588802", "text": "@ElLurk3r @jkempcpa @JoeReynolds2020 You know, Clara Bryant Ford had an electric car she ran around Dearborn in.  There was a reason Henry didn't try to put it in production.  And there's a reason for low EV market penetration today.  It's the capability and financial reality of the technology."}, {"id": "1372956368555155458", "text": "#Enovate’s new #car #factory to integrate scalable #paint_shop built by #Durr #electric_vehicles #e_car #EcoProFleet #automated_guided_vehicles #EcoDry_X_system #energy_efficiency\nhttps://t.co/T7mpxTi8wH"}, {"id": "1372956295624417280", "text": "10 PCS 4-7 PSI 12V Electric Fuel Pump Gas Diesel Car Truck Boat HEP-02A https://t.co/sQXkxvWU6f eBay https://t.co/d3zka4aW11"}, {"id": "1372956293888086025", "text": "RT @AJEnglish: This tiny electric car is outselling Teslas throughout China — and only costs $5,000 😮 https://t.co/Tq5ARrjrws"}, {"id": "1372956150463922176", "text": "Ever wonder who drives the electric car Tesla?......Lady Gaga drives a Tesla....she likes that Tesla uses faux leather for their seats instead of real animal skins....and wowwww have you ever heard Poker Face in a Tesla? 🤟😎🤟 https://t.co/v9mTigomoH"}, {"id": "1372956060445782020", "text": "The new electric Kia EV6 uses the same platform as Hyundai Ioniq 5.\n\nWe've got all the details in our news story. https://t.co/hoFbVTz5rE https://t.co/SaFIKm8PXO"}, {"id": "1372955812247842821", "text": "RT @NCCleanTech: Electric vehicle maker Rivian will put public charging stations in every state park at no cost to the state, with the firs…"}, {"id": "1372955621486649345", "text": "@fuzzinewz @ClimateCrisis @SpeakerPelosi @EPA Buy an electric car."}, {"id": "1372955254233436161", "text": "RT @nickhedley: Local car tech startup launches SAs first electric bakkie - https://t.co/mLxCGDYEck via @ventureburn"}, {"id": "1372955207907254275", "text": "RT @GregKable: Images published by Chinese media suggest prototypes of the @Volkswagen ID.7, a Passat-sized sedan based on the MEB electric…"}, {"id": "1372954888511053824", "text": "RT @GregKable: Images published by Chinese media suggest prototypes of the @Volkswagen ID.7, a Passat-sized sedan based on the MEB electric…"}, {"id": "1372954802544599042", "text": "Chuck Schumer wants to replace every gas car in America with an electric vehicle https://t.co/B5jc0tdeoc via @Verge"}, {"id": "1372954756885458953", "text": "The UK government has cut grants for electric car buyers, to the horror of the automotive industry as it tries to rapidly shift away from fossil fuels. \n\nUK slashes grants for electric car buyers while retaining petrol vehicle support | The Guardian https://t.co/41fMqsaT4F"}, {"id": "1372954755719335946", "text": "RT @AmarUjalaNews: दुनिया की सबसे सस्ती इलेक्ट्रिक कार: 40 पैसे में चलती है एक किलोमीटर, 10 हजार रुपये में हो रही है बुकिंग \nhttps://t.co/Y…"}, {"id": "1372954750912765952", "text": "Does anyone have or know someone who has an electric car?"}, {"id": "1372954637519749124", "text": "UK slashes grants for electric car buyers while retaining petrol vehicle support. Sometimes it seems like incompetence, at other times, malice... https://t.co/tn52OdQH6J"}, {"id": "1372954497597673473", "text": "@VP No that the $1400 wasn't appreciated. But after almost year it barely touched the debt thats built up when living solely on unemployment. The $1400 kept my electric from getting turned off, bought some firewood for heat, a few groceries and a tank of gas for my car. Gone."}, {"id": "1372954404047908867", "text": "Porsche's ambitious EV plans don't include an all-electric 911: Luxury German automaker Porsche expects to significantly increase sales of all-electric vehicles in the coming years, but don't expect an EV version of its iconic 911 sports car anytime… https://t.co/4FWaszCVgG https://t.co/VA6oWbFKve"}, {"id": "1372954195662372869", "text": "Starting April 1, @MyTPU will increase water/electric rates in UP by 5%. 3% is from a utility tax approved by UP City Council last year. This utility tax is offset by a reduction in the City’s portion of your property tax bill &amp; car tab fees. More info at https://t.co/JaVhRLYbkV."}, {"id": "1372954054100410374", "text": "RT @FleetAlliance: The UK Government cuts EV Plug-In Grant with immediate effect in a move denounced as poor timing by the fleet industry.…"}, {"id": "1372953851255533572", "text": "I have already decided that my next car will be an electric. https://t.co/dnuK6CeN7K"}, {"id": "1372953674490785792", "text": "RT @tesla_adri: Since the UK government excluded the model 3 from the electric vehicle grant by reducing the max. price of a eligible car t…"}, {"id": "1372953565879271433", "text": "Just realised that electric cars have made me a car person. Sweet!\n#ElectricCar #ElectricVehicle"}, {"id": "1372953523558739968", "text": "#SouthBend #Indiana, Our #ClubCar limited slip shims can be installed in 1997-2013 Gas units as well as Club Car Electric units with Type K Transaxles. https://t.co/DhlxEdYsDl"}, {"id": "1372953523378343949", "text": "10/ \nRemove:\n\nCoal: 820g CO2 kW/h\nOil: 650g\nGas: 490g\nMarginal emissions,\nGreen hydrogen: 550g\nElectric car: 550g\n\nReduce! Not produce\n\nSee thread for more info\n\n#NoMoreEmptyPromises #RaiseYourStandards #ActOnClimate #ClimateAction #ClimateJustice https://t.co/gtCFNupVpv"}, {"id": "1372953492537638914", "text": "I feel that some legacy car companies rather go broke than sell electric cars. They hate them. Like really really really hate them. $tsla"}, {"id": "1372953329551044611", "text": "@TomiLahren @Varneyco @FoxBusiness Most car manufacturers have pledged to be 100% electric by 2035.  There will be people on this planet after you croak. That pipeline keeps spilling oil on tribal lands. But... we wouldn’t expect you to care about anyone else other than the 1%. Of which, you are not apart."}, {"id": "1372953304834129922", "text": "RT @BilNaylor_: @davidofbuderim @HarryWilkinsonn @thegwpfcom The infra structure for electric cars apart from the marketing is non existent…"}, {"id": "1372952959915597824", "text": "The UK Government cuts EV Plug-In Grant with immediate effect in a move denounced as poor timing by the fleet industry. We have the latest here: https://t.co/WKcI6pCtbK\n\n#EV #plugincargrant #plugingrant #fleetmanagement #fleet #electric"}, {"id": "1372951785741111297", "text": "Can you believe that it takes less time to charge an electric car than refuel on petrol or diesel? #electriccar #driving https://t.co/JRDgxGE2Jk https://t.co/bVpUCWH1eC"}, {"id": "1372951750693453832", "text": "Little car aims big: The @BMW brand #Mini will be purely #electric by 2030. The last model with an internal combustion engine is to be launched on the market in 2025. \n\nhttps://t.co/RYkZh1d5Za"}, {"id": "1372951730745409537", "text": "I need a car to live, so I want to get a hybrid/electric... why are they so fucking £££"}, {"id": "1372951601317433348", "text": "@wcbuecker The cost of gas doesn't bother me as much as the traitors at the Capitol being allowed to go home (I have a hybrid, and am not driving much. My next car will be all electric or hydrogen fueled). Too bad about all those 2 ton trucks w/4-wheel drives."}, {"id": "1372951542710538243", "text": "@elBryan @HuskerNewman @ksorbs Think of all the people living in their homes now that haven’t made a payment in over a year! They’re going to be on the street, Electric cars are nice but we all can’t afford them. People living in their car won’t be able to afford gas to stay warm!"}, {"id": "1372951442911232005", "text": "@RNTata2000 The coming generation is electric vehicle in terms of transport. i want the TATA group to come up with new electric car with solar panel for auto recharge along with manual recharge. Dual charging option should be there"}, {"id": "1372951371209654282", "text": "@Scaramucci @elonmusk The climate change narrative is totally false. Electric car are polluting as much if not more than the usual ones. But I like Elon"}, {"id": "1372951354851913743", "text": "@Fridays4future @GretaThunberg Remove:\n\nCoal: 820g CO2 kW/h\nOil: 650g\nGas: 490g\nMarginal emissions,\nGreen hydrogen: 550g\nElectric car: 550g\n\nReduce! Not produce"}, {"id": "1372951245325881352", "text": "If the fuel pump on your 1995 F-150 sounds like a decelerating Prius or electric car, you might want to get that checked out. https://t.co/RgENYTLxpl"}, {"id": "1372951078996602880", "text": "RT @GregKable: SAIC-owned Roewe has revealed a new concept previewing the next model from its newly created R-TECH electric car sub-brand.…"}, {"id": "1372951056448098309", "text": "Chevy Bolt EV available for just $107 a month - https://t.co/q8F2rxcovW\n\nad_1]\n\nNow’s your chance to get a screaming deal on an electric car.\n\n                                      NewsATW https://t.co/pe4JYSxrU6"}, {"id": "1372950962260873228", "text": "\"Rep. Welch calls #ElectricVehicles “next generation transportation.” The grim irony is that it exposes the inability of his generation—the Baby Boomers—to think outside of the two-ton metal containers within which they’ve lived much of their lives.\"\nhttps://t.co/eMYoJqqYXy"}, {"id": "1372950939473182722", "text": "@umarj83 @adeologo_dire @SaharaReporters You’re funny. When you went on food strike a basket of tomatoes was 150 naira in the north and you couldn’t afford it. Is it electric car that is 5x the price of regular cars you will afford? With bandits destroying electricity in the north? 🤣🤣 get out of here!"}, {"id": "1372950422206308355", "text": "RT @AlanWatsonFeat1: There's hardly a day goes by now without another glaring example of this govt's. demonstration of George Orwell's Doub…"}, {"id": "1372950399003586561", "text": "RT @AlanWatsonFeat1: There's hardly a day goes by now without another glaring example of this govt's. demonstration of George Orwell's Doub…"}, {"id": "1372950331395563528", "text": "RT @ACTforAmerica: What is Joe Biden doing to keep these jobs in America?! https://t.co/TAvLowMyZi"}, {"id": "1372950237288001548", "text": "RT @ThePatsGazette: United Auto Workers REJECT Ford Plan To Build New Electric Car in Mexico Versus Ohio https://t.co/u4O7KCvyRT"}, {"id": "1372950043062378501", "text": "RT @Tom_Meiers_VW: 🚀🚀🚀 @Herbert_Diess talking to Wayne Griffiths, CEO of SEAT and @CUPRA on the future of the brands, #electric #cars and e…"}, {"id": "1372949758046781444", "text": "Helen whats your dream car? — I like the beetle, pick up trucks and hummer. But for the sake of environment, I would buy a Tesla or any other electric car if I could. An enormous electric pickup truck would be ideal 😍 https://t.co/6LWzF9mR5I"}, {"id": "1372949670754803714", "text": "@EvolutionGlobe @ksorbs So MAGA can't figure out how to purchase an electric car??\n\nhttps://t.co/9ypJFreuqV"}, {"id": "1372949641520635905", "text": "WSJ: Investors are starting to actively enter stocks of old-school automakers, which are actively transforming into electric car manufacturers...\n\nsince the beginning of the year, the shares of such producers are actively growing, which cannot be said about the $TSLA shares."}, {"id": "1372949358891646985", "text": "5000 - Pay\n-800 - Rent in shitty dying apartment\n-250 - Car\n-100 - Gas\n-240 - Internet\n-150 - Electric\n-120 - Gas/Water\n-130 - Car Insurance\n-340 - Health Insurance\n-1000 - Child Support\n-400 - Legal Debt\n-500 - Food\n-180 - HRT\n\nthat's 790 left. and I'm ignoring taxes T_T"}, {"id": "1372949263047532547", "text": "@elBryan @ksorbs Coal is dead because it's an expensive dirty fuel that has extraction costs.\n\nOil is dying because battery technology is reducing the costs of an electric car and we have only begun to invest in this technology.\n\nYou want to protect high cost energy. Why?"}, {"id": "1372949185927000068", "text": "@LancasterCC latest additions to our electric pool car fleet working with @Co_wheels. Learn more about the scheme and our future plans to open to the public here: https://t.co/rzx2H69Uu7 https://t.co/yR0GlRwZBZ https://t.co/iSEYZX7VJT"}, {"id": "1372948881940570120", "text": "@mcmansionhell we got an electric riese &amp; muller cargo bike to bring the baby to the daycare instead of getting a car, it owns so much"}, {"id": "1372948742144466946", "text": "Shredding their own #COP26 credibility. https://t.co/FBMWvKdVbG"}, {"id": "1372948730979045381", "text": "Electric vehicles are not only the future of #transportation, but also the best #car purchase right now for consumers and the #environment.\nJoin our free #EV 101 webinar to learn why. RSVP 👇#ClimateFriday\nhttps://t.co/wgUlgC1bv3"}, {"id": "1372948502796505092", "text": "After 17 years of helming electric car manufacturer and motor industry disruptor brand @Tesla, founder Elon Musk has finally given up his title as CEO. He is now opting for the title of ‘Technoking of Tesla’.\n\nhttps://t.co/ymFsvvRCzu"}, {"id": "1372948496177856521", "text": "The EU rules to curb carbon dioxide (CO2) emissions from cars and SUVs could stymie the electric revolution which will only succeed if it embraces the cheap end of the market and the majority of customers.#ElectricVehicles https://t.co/7wpnCM9Ksp"}, {"id": "1372948494302900233", "text": "Stock traders are pouncing on Volkswagen shares, and it could pose a real threat to Tesla in the EV industry https://t.co/GAJafHtv9e"}, {"id": "1372948492612632576", "text": "@KLGLASS2 Watch Who Killed the Electric Car. This explains why we don't have it."}, {"id": "1372948339495424000", "text": "RT @BenChu_: My colleague @_SeanOGrady here argues lowering the electric car grant is probably a mistake\n\nhttps://t.co/yohbs8LW10"}, {"id": "1372948078962036741", "text": "RT @wejoHQ: The two biggest gaps in the electric car battery industry 🔋 The capability of charge time technology and supply. Insight to thi…"}, {"id": "1372948072754511874", "text": "RT @NickAdamsinUSA: American companies shouldn't be allowed to ship our jobs off to Mexico! President Trump would NEVER let this happen! ht…"}, {"id": "1372948014667427841", "text": "RT @wejoHQ: The two biggest gaps in the electric car battery industry 🔋 The capability of charge time technology and supply. Insight to thi…"}, {"id": "1372947887798185984", "text": "RT @AmarUjalaNews: दुनिया की सबसे सस्ती इलेक्ट्रिक कार: 40 पैसे में चलती है एक किलोमीटर, 10 हजार रुपये में हो रही है बुकिंग \nhttps://t.co/Y…"}, {"id": "1372947792604332036", "text": "+ I like change and I'm an early adopter when it comes to technology so electric cars excited me\n\n+ Driving an electric car is the smoothest ride I've ever known, it's like driving on air and it's really nippy. It makes our diesel feel like a bad tempered tank."}, {"id": "1372947790746296333", "text": "Three Years of Having an Electric Car\n\nThree years ago today we welcomed Milky into the family (he sounds like a milk float hence the name) After having an EV as our main car for 3 years I thought I'd do a pros and cons thread... https://t.co/qySaYTDjPa"}, {"id": "1372947742952206339", "text": "“Volkswagen expects to double electric vehicle deliveries and increase profits for its core brand this year after the world’s second-largest carmaker stepped up its switch to fully electric vehicles.” https://t.co/mHtx8jje3R Kudos to @VWGroup https://t.co/hXq497rA1d"}], "meta": {"newest_id": "1372959187035037701", "oldest_id": "1372947742952206339", "result_count": 100, "next_token": "b26v89c19zqg8o3fosqrv3w5lh5j6wxzrk33tvqoe3r0d"}}